Tekla Open API Reference for Tekla Structures 2025
ModelInfo.CurrentPhase Property
 The number of the Tekla Structures model's current phase.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int CurrentPhase { get; set; }
Public Property CurrentPhase As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ModelInfo Class
Tekla.Structures.Model Namespace